<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas_chap03_0725.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
# 딕셔너리를 사용하여 데이터프레임 만들기
friend_dict_list = [
                    {'name':'John', 'age':25, 'job':'student'},
                    {'name':'Nate', 'age':30, 'job':'teacher'}
]
df = pd.DataFrame(friend_dict_list)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [2]:
df = df[['name', 'age', 'job']]
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [3]:
from collections import OrderedDict   # OrderedDict: 키의 순서를 보장
friend_ordered_dict = OrderedDict(
    [
      ('name', ['John', 'Nate']),
      ('age', [25, 30]),
      ('job', ['student', 'teacher'])
    ]
)

In [4]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [6]:
# 리스트를 사용하여 데이터 프레임 만들기
friend_list = [
               ['John', 20, 'student'],
               ['Nate', 30, 'teacher']
]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [7]:
friend_list = [
               ['name', ['John', 'Nate']],
               ['age', [20, 30]],
               ['job', ['student', 'teacher']]
]

In [10]:
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher